Регистрация пользователя в приложении 


# language: ru

@all

Функция: Регистрация пользователя в приложении

Given
Приложение должно предложить пользователю зарегистрироваться
And
Приложение должно выдать предупреждение, если пользователь ввел занятый логин и/или недопустимый пароль
And
Регистрация успешна, если пользователь ввел свободный логин и допустимый пароль

Предыстория:

Given
Допустим пользователь открывает приложение
And
И приложение выдает сообщение о необходимости регистрации

@correct

Сценарий: Успешная регистрация

When
Если пользователь вводит свободный логин и допустимый пароль
Then
То приложение отображает личный кабинет пользователя

@fail

Сценарий: Ошибка регистрации
When
Если пользователь вводит занятый логин и/или недопустимый пароль
Then
То приложение выдает сообщение, что данные некорректны
